app/Controllers/WeddingInvitationController.php

SELECT *
FROM `templates`
WHERE `templates`.`id` = '1'
---
    public function showJoined(string $templateName, string $orderCode)
    {
        $order = $this->weddingOrderModel->getWeddingOrderWithPayment($orderCode);

        // Construct the view path dynamically
        $viewPath = 'invitation/wedding_template/' . $templateName;

        // Check if the view file exists
        if (!is_file(APPPATH . 'Views/' . $viewPath . '.php')) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Template view not found: ' . $viewPath);
        }

        if (!$order) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // Fetch template to get content_structure if needed, similar to Invitation controller
        $template = $this->templateModel->find($order['template_id']);