app/Models/WeddingOrderModel.php

    public function getWeddingOrderWithPayment($orderCode)
    {
        return $this->db->table('wedding_orders AS wo')
            ->select('wo.id AS wedding_order_id, wo.code AS wedding_order_code, wo.template_id, wo.groom_name, wo.bride_name, wo.wedding_date, wo.wedding_time, wo.location, wo.contact, wo.status AS wedding_order_status, p.id AS payment_id, p.amount, p.method, p.status AS payment_status, p.paid_at')
            ->join('payments AS p', 'wo.id_peyment = p.id')
            ->where('wo.code', $orderCode)
            ->get()
            ->getRowArray();
---
SELECT `wo`.`id` AS `wedding_order_id`, `wo`.`code` AS `wedding_order_code`, `wo`.`template_id`, `wo`.`groom_name`, `wo`.`bride_name`, `wo`.`wedding_date`, `wo`.`wedding_time`, `wo`.`location`, `wo`.`contact`, `wo`.`status` AS `wedding_order_status`, `p`.`id` AS `payment_id`, `p`.`amount`, `p`.`method`, `p`.`status` AS `payment_status`, `p`.`paid_at`
FROM `wedding_orders` AS `wo`
JOIN `payments` AS `p` ON `wo`.`id_peyment` = `p`.`id`
WHERE `wo`.`code` = 'POEED-556412'